#!/usr/bin/env python
# -*- coding: utf-8 -*-

jokes = [
    'Инопланетяне не отвечают на наши сообщения, чтобы не выглядеть так, как будто им нужны эти отношения больше нашего.',
    'Чтобы заинтересовать девушку, нужно пошуршать пакетиком с едой.',
    'На заводе по производству носков каждое утро не могут найти второй цех.',
    'Как говорит мой начальник: Хорошо, что вы согласны, потому что все равно придется.',
    'Я финансово независим. Нет финансов нет зависимости.',
    'Лето в Сибири очень жаркое, главное, не пропустить этот день.',
    'Эх, чего бы такого поискать в гугле, чтоб реклама сменилась на смешную.',
    'Не стоит жалеть об ошибках, которые ещё не раз хочется повторить.',
    '"Откуда берутся дети?" именно с таким вопросом подошел Брэд Питт к Анжелине Джоли.',
    '"Такая хорошая погода, надо подвинуть компьютер ближе к окну.',
]

surprises = [
    'За всю свою жизнь человек вырабатывает столько слюны, что ее хватило бы на 2 больших бассейна',
    'Ни одно метро в России не окупается. Настолько дорого обходятся его строительство и эксплуатация.',
    'Клеопатра жила ближе к моменту изобретения iPhone, чем ко времени возведения египетских пирамид.',
    'Арахис не является орехом. Он родственник гороха, чечевицы, фасоли и других бобовых',
    'На луне есть три мяча для гольфа.',
    'Колибри - единственная птица, способная летать назад.',
    'Мона Лиза не имеет бровей. Сбривание бровей было модной тенденцией Флоренции в эпоху Возрождения.',
    'Научно доказанный факт. Гладя кошку вы снижаете свое артериальное давление.',
    'Хоба',
    'смотри, как я могу',
    'это тебя удивит',
    'смотри и учись'
]

macroses = [
    'меня зовут {name} {pause:1} сегодня {date} я из города {city} владелец {user} компания {company} погода {weather} со мной говорили {visitors} на темы {themes} итнернет {internet} уровень заряда {battery} меня создали {dateofcreation} число перезагрузок {reboot_count} время работы {uptime}',
    'макрос',
    '{RSS[news.yandex.ru/health.rss]}',
    'до повтора {repeat} после повтора'
]
